<?php
$wsdl = "http://211.99.191.148/mms/services/info?wsdl";
$client = new SoapClient($wsdl);


//========================第一步==============================================
//账号注册（激活账号--------该方法就使用一次）
//("ZXHD-CRM-0100-XXXXXX", "自己帐户的密码", " 企业名称", "简称", "地址", "电话", "联系人", "email", "fax", "邮编", "手机")
$param = array('in0'=>'ZXHD-CRM-0100-******','in1'=>'自己帐户的密码','in2'=>'企业名称','in3'=>'简称','in4'=>'地址','in5'=>'电话','in6'=>'联系人','in7'=>'email','in8'=>'传真','in9'=>'邮编','in10'=>'手机');
$ret = $client->register($param);
//具体返回值说明参考接口文档
if ($ret='0')
{  print_r($ret->return);}
else{  echo 'fail';}

//===================================第二部========================================
//发送短信（嵌入到自己的系统逻辑）
//sendSMS("ZXHD-CRM-0100-XXXXXX", "密码","手机号码（群发手机号码用英文逗号隔开，最多100个手机号码）", "短信内容",（该参数后的参数是固定的不用修改） "", "1", "", "1", "", "4");
$param = array('in0'=>'ZXHD-CRM-0100-******','in1'=>'密码','in2'=>'手机号码','in3'=>'内容（urlencode(gbk字符集格式)）','in4'=>'','in5'=>'1','in6'=>'','in7'=>'1','in8'=>'','in9'=>'4');
$ret = $client->sendSMS($param);
//具体返回值说明参考接口文档
if ($ret='0')
{  print_r($ret->return);}
else{  echo 'fail';}


//============================根据自己的需要使用====================================================
//查账号余额显示的（根据自己的业务需要使用）
$param = array('in0'=>'ZXHD-CRM-0100-******','in1'=>'密码');
$ret = $client->getbalance($param);
//具体返回值说明参考接口文档
if ($ret>'0')
{  print_r($ret->return);}
else{  echo 'fail';}
